<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Unit;

class UnitSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $items = [
            [1,'สำนักงานเลขานุการกรม','สล.',1,1],
            [2,'กองการเจ้าหน้าที่','กจ.',1,1],
            [3,'กองคลัง','กค.',1,1],
            [4,'สำนักทันตสาธารณสุข','สท.',1,1],
            [5,'กองแผนงาน','กผ.',1,1],
            [6,'สำนักโภชนาการ','สภ.',1,1],
            [7,'กองประเมินผลกระทบต่อสุขภาพ','กป.',1,1],
            [8,'สำนักสุขาภิบาลอาหารและน้ำ','สอน.',1,1],
            [9,'สำนักอนามัยการเจริญพันธุ์','สอพ.',1,1],
            [10,'สำนักส่งเสริมสุขภาพ','สส.',1,1],
            [11,'สำนักอนามัยสิ่งแวดล้อม','สว.',1,1],
            [12,'กองกิจกรรมทางกายเพื่อสุขภาพ','กกส.',1,1],
            [13,'กองส่งเสริมความรอบรู้สุขภาพ','กรส.',1,1],
            [14,'กองกฎหมาย','กกม.',1,1],
            [15,'กลุ่มพัฒนาระบบบริหาร','กพร.',1,1],
            [16,'กลุ่มตรวจสอบภายใน','กตส.',1,1],
            [17,'ศูนย์ความร่วมมือระหว่างประเทศ','ศรป.',1,1],
            [18,'กองห้องปฏิบัติการสาธารสุข กรมอนามัย','กปส.',1,1],
            [19,'สำนักคณะกรรมการผู้ทรงคุณวุฒิ','สกท.',1,1],
            [20,'กองอนามัยฉุกเฉิน','กอฉ.',1,1],
            [21,'สำนักอนามัยผู้สูงอายุ','สอส.',1,1],
            [22,'สถาบันพัฒนาสุขภาวะเขตเมือง','สสม.',1,1],
            [23,'ศูนย์อนามัยที่ 1 เชียงใหม่','ศอ.1 เชียงใหม่',2,1],
            [24,'ศูนย์อนามัยที่ 2 พิษณุโลก','ศอ.2 พิษณุโลก',2,1],
            [25,'ศูนย์อนามัยที่ 3 นครสวรรค์','ศอ.3 นครสวรรค์',2,1],
            [26,'ศูนย์อนามัยที่ 4 สระบุรี','ศอ.4 สระบุรี',2,1],
            [27,'ศูนย์อนามัยที่ 5 ราชบุรี','ศอ.5 ราชบุรี',2,1],
            [28,'ศูนย์อนามัยที่ 6 ชลบุรี','ศอ.6 ชลบุรี',2,1],
            [29,'ศูนย์อนามัยที่ 7 ขอนแก่น','ศอ.7 ขอนแก่น',2,1],
            [30,'ศูนย์อนามัยที่ 8 อุดรธานี','ศอ.8 อุดรธานี',2,1],
            [31,'ศูนย์อนามัยที่ 9 นครราชสีมา','ศอ.9 นครราชสีมา',2,1],
            [32,'ศูนย์อนามัยที่ 10 อุบลราชธานี','ศอ.10 อุบลราชธานี',2,1],
            [33,'ศูนย์อนามัยที่ 11 นครศรีธรรมราช','ศอ.11 นครศรีธรรมราช',2,1],
            [34,'ศูนย์อนามัยที่ 12 ยะลา','ศอ.12 ยะลา',2,1],
            [35,'ศูนย์อนามัยกลุ่มชาติพันธุ์ ชายขอบ และแรงงานข้ามชาติ','ศอช.',1,1],
            [36,'ศูนย์ทันตสาธารณสุขระหว่างประเทศ','ศทป.',1,1],
        ];

        foreach($items as $item){
            $chk = Unit::where('id',$item[0])->first();
            if(empty($chk)){
                Unit::create([
                    'id' => $item[0],
                    'name' => $item[1],
                    'short_name' => $item[2],
                    'area' => $item[3],
                    'type' => $item[4],
                ]);
                echo "Unit ".$item[1]." create successfull."."\n";
            }else{
                $chk->update([
                    'name' => $item[1],
                    'short_name' => $item[2],
                    'area' => $item[3],
                    'type' => $item[4],
                ]);
                echo "Unit ".$item[1]." updated successfull."."\n";
            }
        }
    }
}
